New results (fft improve, gpu timings fix)
Field grid 32x32x32, local force grid 64x64x64, particles 1000000, time in ms
CPU: OpenMP (gcc-11) 16 threads
GPU: Vulkan API 1.1, GLSL Shading Language
|----------------+----------------+----------------+-------------+-----------------|
| Stage          | Apple M1 (CPU) | Apple M1 (GPU) | Ryzen 3700X | Nvidia RTX 3060 |
|----------------+----------------+----------------+-------------+-----------------|
| Density        |           9.63 |           5.36 |        6.01 |            1.36 |
| Poisson        |            1.7 |           1.21 |        1.26 |            0.25 |
| Field strenght |           0.83 |           0.01 |        0.73 |            0.04 |
| Local forces   |         159.20 |         103.06 |      123.91 |           28.84 |
| New positions  |           68.3 |           7.84 |      153.84 |            1.00 |
| Total          |         239.66 |         117.48 |      285.75 |           31.49 |
|----------------+----------------+----------------+-------------+-----------------|
#+TBLFM: @>$2=vsum(@2..@-1)::@>$3=vsum(@2..@-1)::@>$4=vsum(@2..@-1)::@>$5=vsum(@2..@-1)

Field grid 64x64x64, local force grid 64x64x64, particles 1000000, time in ms
CPU: OpenMP (gcc-11) 16 threads
GPU: Vulkan API 1.1, GLSL Shading Language
|----------------+----------------+----------------+-------------+-----------------|
| Stage          | Apple M1 (CPU) | Apple M1 (GPU) | Ryzen 3700X | Nvidia RTX 3060 |
|----------------+----------------+----------------+-------------+-----------------|
| Density        |           9.45 |          11.61 |        6.55 |            2.26 |
| Poisson        |           8.87 |           5.69 |        6.90 |            0.86 |
| Field strenght |           5.99 |           0.01 |        5.32 |            0.14 |
| Local forces   |         313.93 |         103.09 |      209.32 |           28.87 |
| New positions  |          82.74 |           8.38 |       212.8 |            1.41 |
| Total          |         420.98 |         128.78 |      440.89 |           33.54 |
|----------------+----------------+----------------+-------------+-----------------|
#+TBLFM: @>$2=vsum(@2..@-1)::@>$3=vsum(@2..@-1)::@>$4=vsum(@2..@-1)::@>$5=vsum(@2..@-1)

Field grid 128x128x128, no local force, particles 1000000, time in ms
CPU: OpenMP (gcc-11) 16 threads
GPU: Vulkan API 1.1, GLSL Shading Language
|----------------+----------------+----------------+-------------+-----------------|
| Stage          | Apple M1 (CPU) | Apple M1 (GPU) | Ryzen 3700X | Nvidia RTX 3060 |
|----------------+----------------+----------------+-------------+-----------------|
| Density        |          14.65 |          45.08 |       11.52 |            6.58 |
| Poisson        |          68.83 |          40.37 |       62.50 |            5.50 |
| Field strenght |          47.11 |           0.01 |       42.15 |            3.71 |
| New positions  |         133.63 |          12.35 |      242.97 |            1.78 |
| Total          |         264.22 |          97.81 |      359.14 |           17.57 |
|----------------+----------------+----------------+-------------+-----------------|
#+TBLFM: @>$2=vsum(@2..@-1)::@>$3=vsum(@2..@-1)::@>$4=vsum(@2..@-1)::@>$5=vsum(@2..@-1)

PM/PM^3, Nvidia, Total (Left: PM, Right PM^3)
|--------+--------+--------+--------+---------+---------+---------|
| N*10^6 |   n=32 |   n=64 |  n=128 | n=32    | n=64    | n=128   |
|--------+--------+--------+--------+---------+---------+---------|
|      2 |   4.80 |   8.22 |  19.33 | 88.57   | 91.41   | 102.29  |
|      4 |   9.20 |  15.01 |  27.48 | 319.01  | 324.67  | 335.08  |
|      8 |  17.33 |  27.88 |  43.00 | 1141.58 | 1172.94 | 1184.04 |
|     30 |  59.16 |  95.50 | 126.72 | -       | -       | -       |
|     40 |  77.58 | 126.11 | 164.01 | -       | -       | -       |
|    100 | 190.63 | 307.46 | 392.87 | -       | -       | -       |
|--------+--------+--------+--------+---------+---------+---------|

Referencies
1. R.Hockney, J.Eastwood, Computer Simulation Using Particles, McGraw-Hill, 1981,
   (перевод: Р.Хокни, Дж.Иствуд, Численное моделирование методом частиц, Москва, Мир, 1987)
   (PM and P3M algorithms)
2. A.A.Samarskii, E.S.Nikolaev, Numerical Methods For Grid Equations, Birkhauser Verlag, 1989
   (оригинал: А.А.Самарский, Е.С.Николаев, Методы решения сеточных уравнений, Москва, Наука, 1978)
   (Poisson solver)
3. L.Nyland, Fast N-Body simulation with CUDA, in GPU Gems 3, Addison Wesley Professional, 2007
   (Local-force solver)
